Autodesk.Revit.DB.MEPConnectorInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.MEPConnectorInfo.LinkedConnector
The linked connector or null if there is no linked connector
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2016

Autodesk.Revit.DB.MEPConnectorInfo.IsSecondary
True if this is the secondary connector.
Since:
2016

Autodesk.Revit.DB.MEPConnectorInfo.IsPrimary
True if this is the primary connector.
Since:
2016

Autodesk.Revit.DB.MEPConnectorInfo
MEP connector information.
Since:
2016